materials_list = ["草地", "砂岩", "紅石方塊", "冰磚", "黏土", "鵝卵石", "白色羊毛", "橘色羊毛", "洋紅色羊毛", "淺藍色羊毛", "黃色羊毛", "淺綠色羊毛", "粉紅色羊毛",
                  "灰色羊毛", "淺灰色羊毛", "青色羊毛", "紫色羊毛", "藍色羊毛", "棕色羊毛", "綠色羊毛", "紅色羊毛", "黑色羊毛", "青金石磚", "地獄石", "白色陶土",
                  "橘色陶土", "洋紅色陶土", "淺藍色陶土", "黃色陶土", "淺綠色陶土", "粉紅色陶土", "灰色陶土", "淺灰色陶土", "青色陶土", "紫色陶土", "藍色陶土", "棕色陶土",
                  "綠色陶土", "紅色陶土", "黑色陶土"]
not_materials_list = ["蜘蛛網", "六種樹葉", "水桶", "綠寶石方塊", "叢林木材", "橡木材", "樺木原木(水平擺放)", "杉木木材", "鐵方塊", "金方塊", "海磷石磚", "緋紅菌絲石",
                      "緋紅蕈木材", "緋紅菌絲體", "扭曲菌絲石", "扭曲蕈木材", "扭曲菌絲體", "扭曲疙瘩塊"]
not_channel = [858027400808628264, 859309076500709376, 858027511182131200, 858544143168569345, 858219431729823774,
               858236310744989696, 858218055917109288, 858232337899978773, 858261840312532992, 858260258919940108,
               858217557885190168, 858275447955128330, 858182193233657926, 858182260707426304, 858297704602271754,
               865180618634821632]
